<!-- Modal Privacy -->
<div class="modal fade" id="modalPrivacy" tabindex="-1" role="dialog" aria-labelledby="modalPrivacyTitle" aria-hidden="true">
    <div class="modal-dialog modal-lg" role="document">
        <div class="modal-content">
            <div class="modal-header">
                <h5 class="modal-title" id="modalPrivacyTitle">Політика конфіденційності</h5>
                <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                </button>
            </div>
            <div class="modal-body">
                <p>Власник Інтернет Сайту stephub.com (далі — Сайту), в особі Адміністрації Сайту (далі – сторона), приймає на себе зобов'язання щодо захисту конфіденційної інформації та персональних даних Замовників і Виконавців (далі – сторони, яка Передає).</p>

                <h4 id="item-3-1" class="anchor">Визначення понять</h4>
                <p>Передаюча сторона — Замовники і Виконавці, які володіють конфіденційною інформацією та персональними даними, які передаються ними Адміністраці Сайту при реєстрації та використанні Сервісу.</p>
                <p>Сторона, що отримує — Адміністрація, що бере конфіденційну інформацію та персональні дані при наданні послуг Замовникам і Виконавцям.</p>
                <p>Конфіденційна інформація — не є загальнодоступною інформація, яка розголошується Передавальною стороною Отримуючій стороні. Така інформація може позначатися позначкою «конфіденційно», але може такої мітки і не мати, однак за своїм змістом повинна бути сприйнята як конфіденційна.</p>
                <p>Конфіденційною є в тому числі, але не виключно:</p>
                <ul>
                    <li>інформація про рівень технічного розвитку Передавальної сторони, а також успішних технічних рішеннях і перспективах вдосконалення в даній області;</li>
                    <li>відомості про маркетингову чи рекламну політику Передавальної сторони по просуванню своїх товарів, робіт і послуг;</li>
                    <li>інформація, що отримана від третіх осіб, відносно яких Передавальна сторона має зобов'язання про нерозголошення конфіденційної інформації.</li>
                </ul>
                <p>Не є конфіденційною інформація, не залежно від того, як вона позначена, яка:</p>
                <ul>
                    <li>є загальнодоступною, володіння і розголошення якої може призвести до порушення прав і законних інтересів Передавальної сторони;</li>
                    <li>стала відома Отримуючій стороні до реєстрації Передавальною стороною облікового запису на Сайті;</li>
                    <li>представлена Передавальною стороною з письмовою вказівкою про те, що вона не є конфіденційною;</li>
                    <li>стосується відомостей про факт використання Сервісу Передавальною стороною.</li>
                </ul>
                <p>Персональні дані — відомості чи сукупність відомостей про Передавальну сторону, за допомогою якої така Сторона може бути ідентифікована.</p>
                <p>Категоріями Персональних даних Сторін в рамках Сервісу є:</p>
                <ul>
                    <li>адреса електронної пошти;</li>
                    <li>номер студентського квитка;</li>
                    <li>Telegram аккаунт;</li>
                    <li>а також інші дані, за допомогою яких можна ідентифікувати їх власника.</li>
                </ul>

                <h4 id="item-3-2" class="anchor">Загальні положення</h4>
                <p>Метою отримання і обробки Отримуючою стороною конфіденційної інформації і персональних даних є:</p>
                <ul>
                    <li>надання Передавальній стороні доступу до можливостей Сервісу, інформації і матеріалів, розміщених на Сайті;</li>
                    <li>організація комунікації між Сторонами;</li>
                    <li>забезпечення успішної реалізації предмета Договору на виконання робіт/надання послуг, що укладається Замовниками та Виконавцями з використанням Сервісу.</li>
                </ul>

                <h4 id="item-3-3" class="anchor">Повідомлення</h4>
                <ol>
                    <li>Відвідувачі Сайту, що не реєструють обліковий запис, ознайомлені й згодні з тим, що сторона має право збирати про таких відвідувачів певну інформацію, в т. ч. URL і IP –адреси і т. д., які були переглянуті під час відвідування. Ця інформація використовується виключно для внутрішніх цілей і служить для поліпшення роботи Сервісу.</li>
                    <li>Одержуюча сторона обробляє тільки ту конфіденційну інформацію та персональні дані, які необхідні для забезпечення якості надаваємих послуг і не використовує таку інформацію для інших цілей без згоди Передавальної сторони.</li>
                    <li>Одержуюча Сторона зберігає конфіденційну інформацію та персональні дані до тих пір, поки це необхідно для обумовлених цілей у відповідності з чинним законодавством.</li>
                    <li>Передавальній стороні надається безперешкодний доступ до належної їй конфіденційної інформації та персональних даних.</li>
                    <li>Сторона не передає конфіденційну інформацію та персональні дані Передавальної сторони третім особам без згоди власників такої інформації, за винятком випадків, прямо передбачених законом.</li>
                </ol>

                <h4 id="item-3-4" class="anchor">Зобов'язання</h4>
                <ol>
                    <li>Передавальна сторона зобов'язується надати достовірну і повну інформацію.</li>
                    <li>Отримуюча сторона зобов'язується:
                        <ul>
                            <li>використовувати конфіденційну інформацію та персональні дані виключно в цілях забезпечення працездатності Сервісу та реалізації предмета Договору на виконання робіт/надання послуг;</li>
                            <li>не розголошувати конфіденційну інформацію третім особам за винятком передбачених законом випадків;</li>
                            <li>не використовувати конфіденційну інформацію та персональні дані в інтересах, що суперечать цілям, зазначеним у п. 1.1 Політики конфіденційності;</li>
                            <li>максимально обмежити кількість працівників та інших осіб, які мають доступ до конфіденційної інформації та персональних даних, забезпечивши при цьому отримання від них письмових зобов'язань про нерозголошення та невикористання в своїх або чужих інтересах конфіденційної інформації та персональних даних Передавальної сторони.;</li>
                            <li>негайно повідомляти Передавальну сторону про виявлені факти несанкціонованого використання чи розголошення конфіденційної інформації та персональних даних, організовуючи всі необхідні заходи для запобігання подальшого несанкціонованого використання або розкриття такої інформації.;</li>
                            <li>на вимогу сторони, яка Передає знищити отриману конфіденційну інформацію та персональні дані.</li>
                        </ul>
                    </li>
                </ol>

                <h4 id="item-3-5" class="anchor">Прикінцеві положення</h4>
                <ol>
                    <li>База Користувачів Сайту формується Адміністрацією виключно для внутрішнього використання. Адміністрація вживає необхідних заходів програмного і технічного характеру для її захисту, проте не несе відповідальності у разі, якщо Бази Користувачів стали доступні третім особам внаслідок здійснення протиправних дій.</li>
                    <li>При видаленні облікового запису Передавальної сторони, персональні дані такої сторони негайно видаляються, якщо Передавальна сторона раніше не була викрита в шахрайстві на Сайті та звернулася з відповідним проханням до Одержуючої сторони по електронній пошті.: <strong>stephub.com@gmail.com</strong></li>
                    <li>Щоб отримати доступ до інформації, задати питання з приводу нашої політики конфіденційності або подати скаргу, надішліть листа електронною поштою: <strong>stephub.com@gmail.com</strong></li>
                </ol>
            </div>
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-dismiss="modal">Закрити</button>
            </div>
        </div>
    </div>
</div>