<?php
require "php/db.php";

$list_stud = ['ЇЙ25550437', 'ЯТ48367097', 'НУ26665142', 'ЗЕ59854633', 'ЇЇ54722723', 'ВУ77900311', 'ЙО15965819', 'ЖУ60342024', 'ЄТ95949015', 'ПЄ94889724', 'БД33000243', 'МІ51457472', 'АЩ68632512', 'ГТ19203907', 'БУ78214943', 'УЇ23606279', 'ХЩ19417626', 'ЮЕ46155760', 'УЗ37487218', 'ЛП17997427', 'ТЄ73968482', 'УТ31954984', 'ЮВ19282511', 'ЮВ44584711', 'ДУ64494436', 'ОН80650971', 'ЛО01110266', 'ЯО13025011', 'ХЙ47060093', 'МУ43370879', 'ОЇ65221143', 'ВГ34129605', 'ВО37591138', 'ЦІ53550083', 'ЗЛ98244394', 'ПР13324925', 'ЙЇ75932395', 'РШ18522666', 'КХ52738813', 'ЛБ75744575', 'УІ47708861', 'ГЯ94073793', 'ЕР05944415', 'ІЩ71035135', 'ТД16458958', 'ЛА15557987', 'КЕ53234501', 'ОЧ35907862', 'ДА47189570', 'РЩ80142791'];

for ($i = 1; $i < 51; $i++){

    $student = R::dispense('student_ids');
    $student->student_id_num = $list_stud[i-1];
    R::store($student);

    $user = R::dispense('users');
    $user->login = 'login'.$i;
    $user->email = 'email'.$i.'@gmail.com';
    $user->studentid_id = $i;
    $user->telegram_username = 'username'.$i;
    $user->password = password_hash('123', PASSWORD_DEFAULT);
    $user->is_online = 0;
    $user->user_status = 3;
    $user->reg_date = time();

    R::store($user);
}
